Documents/ПлатежноеПоручение.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Document>
		<Properties>
			<Name>ПлатежноеПоручение</Name>
			<BasedOn>
				<xr:Item>Document.ЗаказПоставщику</xr:Item>
				<xr:Item>Document.СчетНаОплатуПоставщика</xr:Item>
				<xr:Item>Document.РасходДСПлан</xr:Item>
			</BasedOn>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>БанковскийСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийПлатежноеПоручение</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПеречисленияВБюджет</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыПеречисленийВБюджет</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПлатежа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИННПлательщика</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИННПолучателя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодБК</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодКОАТУУ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>11</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕДРПОУПлательщика</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕДРПОУПолучателя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НазначениеПлатежа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Оплачено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОчередностьПлатежа</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоказательДаты</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоказательНомера</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>18</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоказательОснования</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>2</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоказательПериода</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоказательТипа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>2</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтавкаНДС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусСоставителя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>2</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаНДС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстПлательщика</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстПолучателя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.НачислениеНалогов</v8:Type>
						<v8:Type>cfg:DocumentRef.РасходДСПлан</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказПоставщику</v8:Type>
						<v8:Type>cfg:DocumentRef.СчетНаОплатуПоставщика</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторПлатежа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХозяйственнаяОперация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХозяйственныеОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Налог</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыНалогов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПоручения</Name>
					<Comment>(Регл)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПоручения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/КурсыВалют.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>КурсыВалют</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Курс</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Кратность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ВидыОперацийПлатежноеПоручение.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>ВидыОперацийПлатежноеПоручение</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Оплата</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПеречислениеНалога</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВариантыУказанияКодПоЕДРПОУ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>ВариантыУказанияКодПоЕДРПОУ</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПриПеречисленииНалогов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВоВсехПлатежныхПоручениях</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/СтатусыУтвержденияПлатежей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>СтатусыУтвержденияПлатежей</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Утвержден</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеУтвержден</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ТипыДенежныхСредств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>ТипыДенежныхСредств</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Наличные</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Безналичные</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/БанковскиеСчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>БанковскиеСчета</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Организации</xr:Item>
				<xr:Item>Catalog.Контрагенты</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВалютаДенежныхСредств</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерСчета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>29</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Банк</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Банки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БанкРасчетов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Банки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетУчета</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Управленческий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидСчета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстКорреспондента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстНазначения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантВыводаМесяца</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыВыводаМесяцаВДатеДокумента</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаБезКопеек</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерИДатаРазрешения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОткрытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗакрытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантУказанияКодПоЕДРПОУ</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыУказанияКодПоЕДРПОУ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>гвФОП</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.гвФОПы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Documents/ПлатежноеПоручение/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПроцедурыЗаполненияДокумента

// Процедура заполнения назначения платежа в документе
//
Процедура ЗаполнитьНазначениеПлатежа()
	
	ТекстПлатежа = "";
	
	КодЯзыкаПечать = "uk";	
	
	Если ЗначениеЗаполнено(СчетКонтрагента) Тогда
		Если ЗначениеЗаполнено(СчетКонтрагента.ТекстКорреспондента) Тогда
			ТекстПолучателя = СчетКонтрагента.ТекстКорреспондента;
		КонецЕсли;
		ТекстПлатежа = СчетКонтрагента.ТекстНазначения;
	ИначеЕсли ЗначениеЗаполнено(Контрагент) Тогда
		ТекстПолучателя = Контрагент.НаименованиеПолное;
	КонецЕсли;
	
	Если ПустаяСтрока(ТекстПлатежа)
		И ЗначениеЗаполнено(ДокументОснование)
		И (ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.СчетНаОплатуПоставщика")
		И ЗначениеЗаполнено(ДокументОснование.НомерВходящегоДокумента) ИЛИ 
		
		ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.РасходДСПлан")
		И ЗначениеЗаполнено(ДокументОснование.ДокументОснование)
		И ЗначениеЗаполнено(ДокументОснование.ДокументОснование.НомерВходящегоДокумента))
		
		Тогда
		
		Если ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.СчетНаОплатуПоставщика") Тогда
			ТекНомер = ДокументОснование.НомерВходящегоДокумента;
			ТекДата = ДокументОснование.ДатаВходящегоДокумента;
		Иначе
			ТекНомер = ДокументОснование.ДокументОснование.НомерВходящегоДокумента;
			ТекДата = ДокументОснование.ДокументОснование.ДатаВходящегоДокумента;
		КонецЕсли;
		
		ТекстПлатежа = НСтр("ru='Оплата по счету N %НомерСчета%';uk='Оплата за рахунком N %НомерСчета%'", КодЯзыкаПечать);
		ТекстПлатежа = СтрЗаменить(ТекстПлатежа, "%НомерСчета%", СокрЛП(Строка(ТекНомер)));
		Если ЗначениеЗаполнено(ТекДата) Тогда
			ТекстПлатежа = ТекстПлатежа + НСтр("ru=' от ';uk=' від '", КодЯзыкаПечать) + СокрЛП(Строка(Формат(ТекДата, "Л="+КодЯзыкаПечать+"; ДФ='dd MMMM yyyy'"))) + НСтр("ru=' г.';uk=' р.'", КодЯзыкаПечать);
		КонецЕсли;
	КонецЕсли;
	
	ТекстНДС = "";
	БезНалогаНДС = Истина;
	
	Если ЗначениеЗаполнено(СтавкаНДС)
	И НЕ СтавкаНДС.НеОблагается Тогда
		ТекстНДС = НСтр("ru='НДС(%СтавкаНДС%) %СуммаНДС%';uk='ПДВ(%СтавкаНДС%) %СуммаНДС%'", КодЯзыкаПечать);
		ТекстНДС = СтрЗаменить(ТекстНДС, "%СтавкаНДС%", Строка(СтавкаНДС));
		ТекстНДС = СтрЗаменить(ТекстНДС, "%СуммаНДС%", Строка(Формат(СуммаНДС, "ЧЦ=15; ЧДЦ=2; ЧРД=-; ЧН=0-00; ЧГ=")));
		БезНалогаНДС = Ложь;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СуммаНДС)
	И НЕ ЗначениеЗаполнено(СтавкаНДС) Тогда
		ТекстНДС = НСтр("ru='НДС %СуммаНДС%';uk='ПДВ %СуммаНДС%'", КодЯзыкаПечать);
		ТекстНДС = СтрЗаменить(ТекстНДС, "%СуммаНДС%", Строка(Формат(СуммаНДС, "ЧЦ=15; ЧДЦ=2; ЧРД=-; ЧН=0-00; ЧГ=")));
		БезНалогаНДС = Ложь;
	КонецЕсли;
	
	ТекстСумма = Строка(Формат(СуммаДокумента, "ЧЦ=15; ЧДЦ=2; ЧРД=-; ЧН=0-00; ЧГ="));
	
	ТекстНазначениеПлатежа = НСтр("ru='%ТекстНазначение%"
"Сумма %ТекстСумма%"
"%ЗначениеСтавкиНДС% %ТекстНДС%';uk='%ТекстНазначение%"
"Сума %ТекстСумма%"
"%ЗначениеСтавкиНДС% %ТекстНДС%'",
	КодЯзыкаПечать
	);
	
	ТекстНазначениеПлатежа = СтрЗаменить(ТекстНазначениеПлатежа, "%ТекстНазначение%", ТекстПлатежа);
	ТекстНазначениеПлатежа = СтрЗаменить(ТекстНазначениеПлатежа, "%ТекстСумма%", ТекстСумма);
	ТекстНазначениеПлатежа = СтрЗаменить(ТекстНазначениеПлатежа, "%ЗначениеСтавкиНДС%", ?(БезНалогаНДС, НСтр("ru='Без налога (НДС)';uk='Без податку (ПДВ)'"), НСтр("ru='В т.ч. ';uk='В т.ч. '", КодЯзыкаПечать)));
	ТекстНазначениеПлатежа = СтрЗаменить(ТекстНазначениеПлатежа, "%ТекстНДС%", ТекстНДС);
	
	НазначениеПлатежа = ТекстНазначениеПлатежа;
	
КонецПроцедуры // ЗаполнитьНазначениеПлатежа()

// Обработчик заполнения документа на основании структуры
//
// Параметры:
// ДанныеЗаполнения - Структура - параметр, переданный в обработчик ОбработкаЗаполнения.
//
Процедура ЗаполнитьПоСтруктуре(ДанныеЗаполнения) Экспорт
	
	Если Не ДанныеЗаполнения.Свойство("Документ") Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(ДанныеЗаполнения.Документ) = Тип("ДокументСсылка.СчетНаОплатуПоставщика") Тогда
		ЗаполнитьПоСчетНаОплатуПоставщика(ДанныеЗаполнения.Документ, ДанныеЗаполнения.Сумма);
	ИначеЕсли ТипЗнч(ДанныеЗаполнения.Документ) = Тип("ДокументСсылка.ЗаказПоставщику") Тогда
		ЗаполнитьПоЗаказПоставщику(ДанныеЗаполнения.Документ, ДанныеЗаполнения.Сумма);
	ИначеЕсли ТипЗнч(ДанныеЗаполнения.Документ) = Тип("ДокументСсылка.РасходДСПлан") Тогда
		ЗаполнитьПоРасходДСПлан(ДанныеЗаполнения.Документ);
	КонецЕсли;
	
КонецПроцедуры // ЗаполнитьПоСтруктуре()

// Обработчик заполнения на основании документа ЗаказПоставщику
//
// Параметры:
//	ДокументСсылкаЗаказПоставщику - ДокументСсылка.ЗаказПоставщику.
//	
Процедура ЗаполнитьПоЗаказПоставщику(ДокументСсылкаЗаказПоставщику, Сумма = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаЗаказПоставщику);
	Запрос.УстановитьПараметр("Дата", ТекущаяДатаСеанса());
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПлатежноеПоручение.Оплата) КАК ВидОперации,
	|	ТаблицаДокумента.Ссылка.Организация КАК Организация,
	|	БанкСчета.ОрганизацияБанковскийСчет КАК БанковскийСчет,
	|	БанкСчета.ВалютаДокумента КАК ВалютаДокумента,
	|	ТаблицаДокумента.Ссылка.Контрагент КАК Контрагент,
	|	ТаблицаДокумента.Ссылка.Организация.ИНН КАК ИННПлательщика,
	|	ВЫБОР
	|		КОГДА БанкСчета.ОрганизацияБанковскийСчет.ВариантУказанияКодПоЕДРПОУ = ЗНАЧЕНИЕ(Перечисление.ВариантыУказанияКодПоЕДРПОУ.ВоВсехПлатежныхПоручениях)
	|			ТОГДА ТаблицаДокумента.Ссылка.Организация.КодПоЕДРПОУ
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК ЕДРПОУПлательщика,
	|	ТаблицаДокумента.Ссылка.Контрагент.ИНН КАК ИННПолучателя,
	|	ТаблицаДокумента.Ссылка.Контрагент.КодПоЕДРПОУ КАК ЕДРПОУПолучателя,
	|	ВЫРАЗИТЬ(ТаблицаДокумента.Ссылка.Контрагент.БанковскийСчетПоУмолчанию.ТекстКорреспондента КАК СТРОКА(1000)) КАК ТекстКорреспондента,
	|	ВЫРАЗИТЬ(ТаблицаДокумента.Ссылка.Контрагент.БанковскийСчетПоУмолчанию.ТекстНазначения КАК СТРОКА(1000)) КАК ТекстНазначения,
	|	ВЫРАЗИТЬ(ТаблицаДокумента.Ссылка.Контрагент.НаименованиеПолное КАК СТРОКА(1000)) КАК НаименованиеПолное,
	|	СУММА(ВЫРАЗИТЬ(ТаблицаДокумента.Всего * ВЫБОР
	|				КОГДА ТаблицаДокумента.Ссылка.ВалютаДокумента <> БанкСчета.ОрганизацияБанковскийСчет.ВалютаДенежныхСредств
	|						И КурсыВалютДокумента.Кратность <> 0
	|						И КурсыВалютБанковскогоСчета.Курс <> 0
	|					ТОГДА КурсыВалютДокумента.Курс * КурсыВалютБанковскогоСчета.Кратность / (ЕСТЬNULL(КурсыВалютБанковскогоСчета.Курс, 1) * ЕСТЬNULL(КурсыВалютДокумента.Кратность, 1))
	|				ИНАЧЕ 1
	|			КОНЕЦ КАК ЧИСЛО(15, 2))) КАК СуммаДокумента,
	|	СУММА(ВЫРАЗИТЬ(ТаблицаДокумента.СуммаНДС * ВЫБОР
	|				КОГДА ТаблицаДокумента.Ссылка.ВалютаДокумента <> БанкСчета.ОрганизацияБанковскийСчет.ВалютаДенежныхСредств
	|						И КурсыВалютДокумента.Кратность <> 0
	|						И КурсыВалютБанковскогоСчета.Курс <> 0
	|					ТОГДА КурсыВалютДокумента.Курс * КурсыВалютБанковскогоСчета.Кратность / (ЕСТЬNULL(КурсыВалютБанковскогоСчета.Курс, 1) * ЕСТЬNULL(КурсыВалютДокумента.Кратность, 1))
	|				ИНАЧЕ 1
	|			КОНЕЦ КАК ЧИСЛО(15, 2))) КАК СуммаНДС,
	|	ВЫБОР
	|		КОГДА СтавкаНДСИзДокумента.КоличествоРазличныхСтавок = 1
	|			ТОГДА ТаблицаДокумента.СтавкаНДС
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК СтавкаНДС,
	|	СтавкаНДСИзДокумента.КоличествоРазличныхСтавок КАК КоличествоРазличныхСтавок,
	|	ТаблицаДокумента.Ссылка КАК ДокументОснование,
	|	ТаблицаДокумента.Ссылка.Дата КАК ДатаПоручения
	|ИЗ
	|	Документ.ЗаказПоставщику.Запасы КАК ТаблицаДокумента
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&Дата, ) КАК КурсыВалютДокумента
	|		ПО ТаблицаДокумента.Ссылка.ВалютаДокумента = КурсыВалютДокумента.Валюта
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ЗаказПоставщикуЗапасы.СтавкаНДС) КАК КоличествоРазличныхСтавок,
	|			ЗаказПоставщикуЗапасы.Ссылка КАК Ссылка
	|		ИЗ
	|			Документ.ЗаказПоставщику.Запасы КАК ЗаказПоставщикуЗапасы
	|		ГДЕ
	|			ЗаказПоставщикуЗапасы.Ссылка = &Ссылка
	|		
	|		СГРУППИРОВАТЬ ПО
	|			ЗаказПоставщикуЗапасы.Ссылка) КАК СтавкаНДСИзДокумента
	|		ПО ТаблицаДокумента.Ссылка = СтавкаНДСИзДокумента.Ссылка,
	|	(ВЫБРАТЬ ПЕРВЫЕ 1
	|		ВЫБОР
	|			КОГДА ЗаказПоставщику.БанковскийСчет <> ЗНАЧЕНИЕ(Справочник.БанковскиеСчета.ПустаяСсылка)
	|				ТОГДА ЗаказПоставщику.БанковскийСчет
	|			КОГДА ЗаказПоставщику.Организация.БанковскийСчетПоУмолчанию.ВалютаДенежныхСредств = ЗаказПоставщику.Договор.ВалютаРасчетов
	|				ТОГДА ЗаказПоставщику.Организация.БанковскийСчетПоУмолчанию
	|			КОГДА ЕСТЬNULL(БанковскиеСчетаОрганизации.Ссылка, ЗНАЧЕНИЕ(Справочник.БанковскиеСчета.ПустаяСсылка)) <> ЗНАЧЕНИЕ(Справочник.БанковскиеСчета.ПустаяСсылка)
	|				ТОГДА БанковскиеСчетаОрганизации.Ссылка
	|			ИНАЧЕ ЗаказПоставщику.Организация.БанковскийСчетПоУмолчанию
	|		КОНЕЦ КАК ОрганизацияБанковскийСчет,
	|		ВЫБОР
	|			КОГДА ЗаказПоставщику.БанковскийСчет <> ЗНАЧЕНИЕ(Справочник.БанковскиеСчета.ПустаяСсылка)
	|				ТОГДА ЗаказПоставщику.БанковскийСчет.ВалютаДенежныхСредств
	|			КОГДА ЗаказПоставщику.Организация.БанковскийСчетПоУмолчанию.ВалютаДенежныхСредств = ЗаказПоставщику.Договор.ВалютаРасчетов
	|				ТОГДА ЗаказПоставщику.Организация.БанковскийСчетПоУмолчанию.ВалютаДенежныхСредств
	|			КОГДА ЕСТЬNULL(БанковскиеСчетаОрганизации.Ссылка, ЗНАЧЕНИЕ(Справочник.БанковскиеСчета.ПустаяСсылка)) <> ЗНАЧЕНИЕ(Справочник.БанковскиеСчета.ПустаяСсылка)
	|				ТОГДА БанковскиеСчетаОрганизации.ВалютаДенежныхСредств
	|			ИНАЧЕ ЗаказПоставщику.Организация.БанковскийСчетПоУмолчанию.ВалютаДенежныхСредств
	|		КОНЕЦ КАК ВалютаДокумента
	|	ИЗ
	|		Документ.ЗаказПоставщику КАК ЗаказПоставщику
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.БанковскиеСчета КАК БанковскиеСчетаОрганизации
	|			ПО ЗаказПоставщику.Организация = БанковскиеСчетаОрганизации.Владелец
	|				И ЗаказПоставщику.ВалютаДокумента = БанковскиеСчетаОрганизации.ВалютаДенежныхСредств
	|				И (БанковскиеСчетаОрганизации.ПометкаУдаления = ЛОЖЬ)
	|	ГДЕ
	|		ЗаказПоставщику.Ссылка = &Ссылка) КАК БанкСчета
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&Дата, ) КАК КурсыВалютБанковскогоСчета
	|		ПО БанкСчета.ОрганизацияБанковскийСчет.ВалютаДенежныхСредств = КурсыВалютБанковскогоСчета.Валюта
	|ГДЕ
	|	ТаблицаДокумента.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ВЫБОР
	|		КОГДА СтавкаНДСИзДокумента.КоличествоРазличныхСтавок = 1
	|			ТОГДА ТаблицаДокумента.СтавкаНДС
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	ТаблицаДокумента.Ссылка.Организация,
	|	ТаблицаДокумента.Ссылка.Контрагент,
	|	ТаблицаДокумента.Ссылка.Контрагент.ИНН,
	|	ТаблицаДокумента.Ссылка.Контрагент.КодПоЕДРПОУ,
	|	ВЫРАЗИТЬ(ТаблицаДокумента.Ссылка.Контрагент.БанковскийСчетПоУмолчанию.ТекстКорреспондента КАК СТРОКА(1000)),
	|	ВЫРАЗИТЬ(ТаблицаДокумента.Ссылка.Контрагент.НаименованиеПолное КАК СТРОКА(1000)),
	|	ВЫРАЗИТЬ(ТаблицаДокумента.Ссылка.Контрагент.БанковскийСчетПоУмолчанию.ТекстНазначения КАК СТРОКА(1000)),
	|	СтавкаНДСИзДокумента.КоличествоРазличныхСтавок,
	|	БанкСчета.ОрганизацияБанковскийСчет,
	|	БанкСчета.ВалютаДокумента,
	|	ТаблицаДокумента.Ссылка,
	|	ТаблицаДокумента.Ссылка.Организация.ИНН,
	|	ВЫБОР
	|		КОГДА БанкСчета.ОрганизацияБанковскийСчет.ВариантУказанияКодПоЕДРПОУ = ЗНАЧЕНИЕ(Перечисление.ВариантыУказанияКодПоЕДРПОУ.ВоВсехПлатежныхПоручениях)
	|			ТОГДА ТаблицаДокумента.Ссылка.Организация.КодПоЕДРПОУ
	|		ИНАЧЕ """"
	|	КОНЕЦ";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, Выборка);
		
	Если ЭтотОбъект.ДатаПоручения < ТекущаяДата() Тогда
		ЭтотОбъект.ДатаПоручения = ТекущаяДата();	
	КонецЕсли;
		
	УстановитьНомерПоручения();
	
	ЗаполнитьНазначениеПлатежа();
	
	Если Не ЗначениеЗаполнено(ВалютаДокумента) Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Контрагент) Тогда
		Возврат;
	КонецЕсли;
	
	Если Контрагент.БанковскийСчетПоУмолчанию.ВалютаДенежныхСредств = ВалютаДокумента Тогда
		СчетКонтрагента = Контрагент.БанковскийСчетПоУмолчанию;
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	БанковскиеСчетаКонтрагента.Ссылка
	|ИЗ
	|	Справочник.БанковскиеСчета КАК БанковскиеСчетаКонтрагента
	|ГДЕ
	|	БанковскиеСчетаКонтрагента.ВалютаДенежныхСредств = &ВалютаДокумента
	|	И БанковскиеСчетаКонтрагента.Владелец = &Контрагент
	|	И БанковскиеСчетаКонтрагента.ПометкаУдаления = ЛОЖЬ");
	Запрос.УстановитьПараметр("ВалютаДокумента", ВалютаДокумента);
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	ВыборкаРезультатаЗапроса = Запрос.Выполнить().Выбрать();
	Если ВыборкаРезультатаЗапроса.Следующий() Тогда
		СчетКонтрагента = ВыборкаРезультатаЗапроса.Ссылка;
	КонецЕсли;
	
КонецПроцедуры // ЗаполнитьПоЗаказПоставщику()

// Обработчик заполнения на основании документа СчетНаОплатуПоставщика
//
// Параметры:
//	ДокументСсылкаСчетНаОплатуПоставщика - ДокументСсылка.СчетНаОплатуПоставщика.
//	
Процедура ЗаполнитьПоСчетНаОплатуПоставщика(ДокументСсылкаСчетНаОплатуПоставщика, Сумма = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаСчетНаОплатуПоставщика);
	Запрос.УстановитьПараметр("Дата", ТекущаяДатаСеанса());
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПлатежноеПоручение.Оплата) КАК ВидОперации,
	|	ТаблицаДокумента.Ссылка.Организация КАК Организация,
	|	БанкСчета.ОрганизацияБанковскийСчет КАК БанковскийСчет,
	|	БанкСчета.ВалютаДокумента КАК ВалютаДокумента,
	|	ТаблицаДокумента.Ссылка.Контрагент КАК Контрагент,
	|	БанкСчета.КонтрагентБанковскийСчет КАК СчетКонтрагента,
	|	ТаблицаДокумента.Ссылка.Организация.ИНН КАК ИННПлательщика,
	|	ВЫБОР
	|		КОГДА БанкСчета.ОрганизацияБанковскийСчет.ВариантУказанияКодПоЕДРПОУ = ЗНАЧЕНИЕ(Перечисление.ВариантыУказанияКодПоЕДРПОУ.ВоВсехПлатежныхПоручениях)
	|			ТОГДА ТаблицаДокумента.Ссылка.Организация.КодПоЕДРПОУ
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК ЕДРПОУПлательщика,
	|	ТаблицаДокумента.Ссылка.Контрагент.ИНН КАК ИННПолучателя,
	|	ТаблицаДокумента.Ссылка.Контрагент.КодПоЕДРПОУ КАК ЕДРПОУПолучателя,
	|	ВЫРАЗИТЬ(ТаблицаДокумента.Ссылка.Контрагент.БанковскийСчетПоУмолчанию.ТекстКорреспондента КАК СТРОКА(1000)) КАК ТекстКорреспондента,
	|	ВЫРАЗИТЬ(ТаблицаДокумента.Ссылка.Контрагент.БанковскийСчетПоУмолчанию.ТекстНазначения КАК СТРОКА(1000)) КАК ТекстНазначения,
	|	ВЫРАЗИТЬ(ТаблицаДокумента.Ссылка.Контрагент.НаименованиеПолное КАК СТРОКА(1000)) КАК НаименованиеПолное,
	|	СУММА(ВЫРАЗИТЬ(ТаблицаДокумента.Всего * ВЫБОР
	|				КОГДА ТаблицаДокумента.Ссылка.ВалютаДокумента <> БанкСчета.ОрганизацияБанковскийСчет.ВалютаДенежныхСредств
	|						И КурсыВалютДокумента.Кратность <> 0
	|						И КурсыВалютБанковскогоСчета.Курс <> 0
	|					ТОГДА КурсыВалютДокумента.Курс * КурсыВалютБанковскогоСчета.Кратность / (ЕСТЬNULL(КурсыВалютБанковскогоСчета.Курс, 1) * ЕСТЬNULL(КурсыВалютДокумента.Кратность, 1))
	|				ИНАЧЕ 1
	|			КОНЕЦ КАК ЧИСЛО(15, 2))) КАК СуммаДокумента,
	|	СУММА(ВЫРАЗИТЬ(ТаблицаДокумента.СуммаНДС * ВЫБОР
	|				КОГДА ТаблицаДокумента.Ссылка.ВалютаДокумента <> БанкСчета.ОрганизацияБанковскийСчет.ВалютаДенежныхСредств
	|						И КурсыВалютДокумента.Кратность <> 0
	|						И КурсыВалютБанковскогоСчета.Курс <> 0
	|					ТОГДА КурсыВалютДокумента.Курс * КурсыВалютБанковскогоСчета.Кратность / (ЕСТЬNULL(КурсыВалютБанковскогоСчета.Курс, 1) * ЕСТЬNULL(КурсыВалютДокумента.Кратность, 1))
	|				ИНАЧЕ 1
	|			КОНЕЦ КАК ЧИСЛО(15, 2))) КАК СуммаНДС,
	|	ВЫБОР
	|		КОГДА СтавкаНДСИзДокумента.КоличествоРазличныхСтавок = 1
	|			ТОГДА ТаблицаДокумента.СтавкаНДС
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК СтавкаНДС,
	|	СтавкаНДСИзДокумента.КоличествоРазличныхСтавок КАК КоличествоРазличныхСтавок,
	|	ТаблицаДокумента.Ссылка КАК ДокументОснование,
	|	ТаблицаДокумента.Ссылка.Дата КАК ДатаПоручения
	|ИЗ
	|	Документ.СчетНаОплатуПоставщика.Запасы КАК ТаблицаДокумента
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&Дата, ) КАК КурсыВалютДокумента
	|		ПО ТаблицаДокумента.Ссылка.ВалютаДокумента = КурсыВалютДокумента.Валюта
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			КОЛИЧЕСТВО(РАЗЛИЧНЫЕ СчетНаОплатуПоставщикаЗапасы.СтавкаНДС) КАК КоличествоРазличныхСтавок,
	|			СчетНаОплатуПоставщикаЗапасы.Ссылка КАК Ссылка
	|		ИЗ
	|			Документ.СчетНаОплатуПоставщика.Запасы КАК СчетНаОплатуПоставщикаЗапасы
	|		ГДЕ
	|			СчетНаОплатуПоставщикаЗапасы.Ссылка = &Ссылка
	|		
	|		СГРУППИРОВАТЬ ПО
	|			СчетНаОплатуПоставщикаЗапасы.Ссылка) КАК СтавкаНДСИзДокумента
	|		ПО ТаблицаДокумента.Ссылка = СтавкаНДСИзДокумента.Ссылка,
	|	(ВЫБРАТЬ ПЕРВЫЕ 1
	|		ВЫБОР
	|			КОГДА СчетНаОплатуПоставщика.БанковскийСчет <> ЗНАЧЕНИЕ(Справочник.БанковскиеСчета.ПустаяСсылка)
	|				ТОГДА СчетНаОплатуПоставщика.БанковскийСчет
	|			КОГДА СчетНаОплатуПоставщика.ВалютаДокумента = СчетНаОплатуПоставщика.Организация.БанковскийСчетПоУмолчанию.ВалютаДенежныхСредств
	|				ТОГДА СчетНаОплатуПоставщика.Организация.БанковскийСчетПоУмолчанию
	|			ИНАЧЕ БанковскиеСчетаОрганизации.Ссылка
	|		КОНЕЦ КАК ОрганизацияБанковскийСчет,
	|		ВЫБОР
	|			КОГДА СчетНаОплатуПоставщика.БанковскийСчет <> ЗНАЧЕНИЕ(Справочник.БанковскиеСчета.ПустаяСсылка)
	|				ТОГДА СчетНаОплатуПоставщика.БанковскийСчет.ВалютаДенежныхСредств
	|			КОГДА СчетНаОплатуПоставщика.ВалютаДокумента = СчетНаОплатуПоставщика.Организация.БанковскийСчетПоУмолчанию.ВалютаДенежныхСредств
	|				ТОГДА СчетНаОплатуПоставщика.Организация.БанковскийСчетПоУмолчанию.ВалютаДенежныхСредств
	|			КОГДА БанковскиеСчетаОрганизации.Ссылка <> ЗНАЧЕНИЕ(Справочник.БанковскиеСчета.ПустаяСсылка)
	|				ТОГДА БанковскиеСчетаОрганизации.Ссылка.ВалютаДенежныхСредств
	|			ИНАЧЕ СчетНаОплатуПоставщика.ВалютаДокумента
	|		КОНЕЦ КАК ВалютаДокумента,
	|		ВЫБОР
	|			КОГДА СчетНаОплатуПоставщика.ВалютаДокумента = СчетНаОплатуПоставщика.Контрагент.БанковскийСчетПоУмолчанию.ВалютаДенежныхСредств
	|				ТОГДА СчетНаОплатуПоставщика.Контрагент.БанковскийСчетПоУмолчанию
	|			ИНАЧЕ БанковскиеСчетаКонтрагента.Ссылка
	|		КОНЕЦ КАК КонтрагентБанковскийСчет
	|	ИЗ
	|		Документ.СчетНаОплатуПоставщика КАК СчетНаОплатуПоставщика
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.БанковскиеСчета КАК БанковскиеСчетаКонтрагента
	|			ПО СчетНаОплатуПоставщика.ВалютаДокумента = БанковскиеСчетаКонтрагента.ВалютаДенежныхСредств
	|				И СчетНаОплатуПоставщика.Контрагент = БанковскиеСчетаКонтрагента.Владелец
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.БанковскиеСчета КАК БанковскиеСчетаОрганизации
	|			ПО СчетНаОплатуПоставщика.Организация = БанковскиеСчетаОрганизации.Владелец
	|				И СчетНаОплатуПоставщика.ВалютаДокумента = БанковскиеСчетаОрганизации.ВалютаДенежныхСредств
	|	ГДЕ
	|		СчетНаОплатуПоставщика.Ссылка = &Ссылка) КАК БанкСчета
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&Дата, ) КАК КурсыВалютБанковскогоСчета
	|		ПО БанкСчета.ОрганизацияБанковскийСчет.ВалютаДенежныхСредств = КурсыВалютБанковскогоСчета.Валюта
	|ГДЕ
	|	ТаблицаДокумента.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ВЫБОР
	|		КОГДА СтавкаНДСИзДокумента.КоличествоРазличныхСтавок = 1
	|			ТОГДА ТаблицаДокумента.СтавкаНДС
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	ТаблицаДокумента.Ссылка.Организация,
	|	ТаблицаДокумента.Ссылка.Контрагент,
	|	ТаблицаДокумента.Ссылка.Контрагент.ИНН,
	|	ТаблицаДокумента.Ссылка.Контрагент.КодПоЕДРПОУ,
	|	ВЫРАЗИТЬ(ТаблицаДокумента.Ссылка.Контрагент.БанковскийСчетПоУмолчанию.ТекстКорреспондента КАК СТРОКА(1000)),
	|	ВЫРАЗИТЬ(ТаблицаДокумента.Ссылка.Контрагент.НаименованиеПолное КАК СТРОКА(1000)),
	|	ВЫРАЗИТЬ(ТаблицаДокумента.Ссылка.Контрагент.БанковскийСчетПоУмолчанию.ТекстНазначения КАК СТРОКА(1000)),
	|	СтавкаНДСИзДокумента.КоличествоРазличныхСтавок,
	|	БанкСчета.ОрганизацияБанковскийСчет,
	|	БанкСчета.ВалютаДокумента,
	|	БанкСчета.КонтрагентБанковскийСчет,
	|	ТаблицаДокумента.Ссылка,
	|	ТаблицаДокумента.Ссылка.Организация.ИНН,
	|	ВЫБОР
	|		КОГДА БанкСчета.ОрганизацияБанковскийСчет.ВариантУказанияКодПоЕДРПОУ = ЗНАЧЕНИЕ(Перечисление.ВариантыУказанияКодПоЕДРПОУ.ВоВсехПлатежныхПоручениях)
	|			ТОГДА ТаблицаДокумента.Ссылка.Организация.КодПоЕДРПОУ
	|		ИНАЧЕ """"
	|	КОНЕЦ";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, Выборка);
		
	Если ЭтотОбъект.ДатаПоручения < ТекущаяДата() Тогда
		ЭтотОбъект.ДатаПоручения = ТекущаяДата();	
	КонецЕсли;
	
	УстановитьНомерПоручения();
	
	ЗаполнитьНазначениеПлатежа();
	
КонецПроцедуры // ЗаполнитьПоСчетНаОплатуПоставщика()

// Обработчик заполнения на основании документа РасходДСПлан.
//
// Параметры:
//	ДокументСсылкаРасходДСПлан - ДокументСсылка.РасходДСПлан.
//	
Процедура ЗаполнитьПоРасходДСПлан(ДокументСсылкаРасходДСПлан) Экспорт
	
	Если ДокументСсылкаРасходДСПлан.СтатусУтвержденияПлатежа = Перечисления.СтатусыУтвержденияПлатежей.НеУтвержден Тогда
		ВызватьИсключение НСтр("ru='Нельзя ввести платежное поручение на основании не утвержденной заявки!';uk='Не можна ввести платіжне доручення на підставі не затвердженої заявки!'");
	КонецЕсли;
	
	Если ДокументСсылкаРасходДСПлан.ТипДенежныхСредств = Перечисления.ТипыДенежныхСредств.Наличные Тогда
		ВызватьИсключение НСтр("ru='Нельзя ввести платежное поручение. В заявке указан не верный способ оплаты (тип денежных средств)!';uk='Не можна ввести платіжне доручення. У заявці зазначений не вірний спосіб оплати (тип коштів)!'");
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДокументОснование", ДокументСсылкаРасходДСПлан);
	Запрос.УстановитьПараметр("Дата", ТекущаяДатаСеанса());
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПлатежноеПоручение.Оплата) КАК ВидОперации,
	|	&ДокументОснование КАК ДокументОснование,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.ДокументОснование ССЫЛКА Документ.СчетНаОплатуПоставщика
	|			ТОГДА ТаблицаДокумента.ДокументОснование
	|		ИНАЧЕ ЗНАЧЕНИЕ(Документ.СчетНаОплатуПоставщика.ПустаяСсылка)
	|	КОНЕЦ КАК СчетНаОплату,
	|	ТаблицаДокумента.Организация КАК Организация,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.ДокументОснование ССЫЛКА Документ.СчетНаОплатуПоставщика
	|				ИЛИ ТаблицаДокумента.ДокументОснование ССЫЛКА Документ.ЗаказПоставщику
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ПризнакАванса,
	|	ТаблицаДокумента.СтатьяДвиженияДенежныхСредств КАК Статья,
	|	ТаблицаДокумента.БанковскийСчет КАК БанковскийСчет,
	|	ВложенныйЗапрос.КонтрагентБанковскийСчет КАК СчетКонтрагента,
	|	ТаблицаДокумента.Организация.ИНН КАК ИННПлательщика,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.БанковскийСчет.ВариантУказанияКодПоЕДРПОУ = ЗНАЧЕНИЕ(Перечисление.ВариантыУказанияКодПоЕДРПОУ.ВоВсехПлатежныхПоручениях)
	|			ТОГДА ТаблицаДокумента.Организация.КодПоЕДРПОУ
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК ЕДРПОУПлательщика,
	|	ТаблицаДокумента.Контрагент.ИНН КАК ИННПолучателя,
	|	ТаблицаДокумента.Контрагент.КодПоЕДРПОУ КАК ЕДРПОУПолучателя,
	|	ТаблицаДокумента.ВалютаДокумента КАК ВалютаДокумента,
	|	ТаблицаДокумента.Контрагент КАК Контрагент,
	|	ТаблицаДокумента.Договор КАК Договор,
	|	ТаблицаДокумента.СуммаДокумента КАК СуммаДокумента,
	|	ТаблицаДокумента.СуммаДокумента КАК СуммаПлатежа,
	|	ТаблицаДокумента.Организация.СтавкаНДСПоУмолчанию КАК СтавкаНДС,
	|	ЕСТЬNULL(КурсыВалютРасчетов.Курс, 1) КАК Курс,
	|	ЕСТЬNULL(КурсыВалютРасчетов.Кратность, 1) КАК Кратность,
	|	ВЫРАЗИТЬ(ТаблицаДокумента.СуммаДокумента * ВЫБОР
	|			КОГДА ТаблицаДокумента.ВалютаДокумента <> ТаблицаДокумента.Договор.ВалютаРасчетов
	|					И КурсыВалютРасчетов.Курс <> 0
	|					И КурсыВалютДокумента.Кратность <> 0
	|				ТОГДА КурсыВалютДокумента.Курс * КурсыВалютРасчетов.Кратность / (ЕСТЬNULL(КурсыВалютРасчетов.Курс, 1) * ЕСТЬNULL(КурсыВалютДокумента.Кратность, 1))
	|			ИНАЧЕ 1
	|		КОНЕЦ КАК ЧИСЛО(15, 2)) КАК СуммаРасчетов,
	|	ВЫРАЗИТЬ(ТаблицаДокумента.СуммаДокумента * (1 - 1 / ((ЕСТЬNULL(ТаблицаДокумента.Организация.СтавкаНДСПоУмолчанию.Ставка, 0) + 100) / 100)) КАК ЧИСЛО(15, 2)) КАК СуммаНДС,
	|	ТаблицаДокумента.Дата КАК ДатаПоручения
	|ИЗ
	|	Документ.РасходДСПлан КАК ТаблицаДокумента
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&Дата, ) КАК КурсыВалютРасчетов
	|		ПО ТаблицаДокумента.Договор.ВалютаРасчетов = КурсыВалютРасчетов.Валюта
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&Дата, ) КАК КурсыВалютДокумента
	|		ПО ТаблицаДокумента.ВалютаДокумента = КурсыВалютДокумента.Валюта
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ ПЕРВЫЕ 1
	|			ВЫБОР
	|				КОГДА ТаблицаДокумента.ВалютаДокумента = ТаблицаДокумента.Контрагент.БанковскийСчетПоУмолчанию.ВалютаДенежныхСредств
	|					ТОГДА ТаблицаДокумента.Контрагент.БанковскийСчетПоУмолчанию
	|				ИНАЧЕ БанковскиеСчетаКонтрагента.Ссылка
	|			КОНЕЦ КАК КонтрагентБанковскийСчет
	|		ИЗ
	|			Документ.РасходДСПлан КАК ТаблицаДокумента
	|				ЛЕВОЕ СОЕДИНЕНИЕ Справочник.БанковскиеСчета КАК БанковскиеСчетаКонтрагента
	|				ПО ТаблицаДокумента.ВалютаДокумента = БанковскиеСчетаКонтрагента.ВалютаДенежныхСредств
	|					И ТаблицаДокумента.Контрагент = БанковскиеСчетаКонтрагента.Владелец
	|		ГДЕ
	|			ТаблицаДокумента.Ссылка = &ДокументОснование
	|			И БанковскиеСчетаКонтрагента.ПометкаУдаления = ЛОЖЬ) КАК ВложенныйЗапрос
	|		ПО (ИСТИНА)
	|ГДЕ
	|	ТаблицаДокумента.Ссылка = &ДокументОснование";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, Выборка);
	
	Если ДокументОснование.ВалютаДокумента = Контрагент.БанковскийСчетПоУмолчанию.ВалютаДенежныхСредств Тогда
		СчетКонтрагента = Контрагент.БанковскийСчетПоУмолчанию;
	КонецЕсли;
		
	Если ЭтотОбъект.ДатаПоручения < ТекущаяДата() Тогда
		ЭтотОбъект.ДатаПоручения = ТекущаяДата();	
	КонецЕсли;
	
	УстановитьНомерПоручения();
	
	ЗаполнитьНазначениеПлатежа();
	
КонецПроцедуры //ЗаполнитьПоРасходДСПлан()

// Формирует номер платежного поручения в пределах расчетного счета
//
Процедура УстановитьНомерПоручения() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДатаНачалаГода", НачалоГода(Дата));
	Запрос.УстановитьПараметр("ДатаКонцаГода", КонецГода(Дата));
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("БанковскийСчет", БанковскийСчет);

	Запрос.Текст =
	"ВЫБРАТЬ
	|	НомерПоручения КАК НомерПоручения
	|ИЗ
	|	Документ.ПлатежноеПоручение КАК ПлатежноеПоручение
	|
	|ГДЕ
	|	ПлатежноеПоручение.Организация = &Организация
	|	И ПлатежноеПоручение.БанковскийСчет = &БанковскийСчет
	|	И ПлатежноеПоручение.Дата >= &ДатаНачалаГода
	|	И ПлатежноеПоручение.Дата <= &ДатаКонцаГода";

	Если ЗначениеЗаполнено(Ссылка) Тогда
		Запрос.Текст = Запрос.Текст + "	И ПлатежноеПоручение.Ссылка <> &Ссылка ";
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
	КонецЕсли;
	
	РезультатЗапроса = Запрос.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() Тогда
		
		СписокПлатежек = РезультатЗапроса.Выбрать();
		
		ТаблицаЗначений = Новый ТаблицаЗначений;
		
		ТаблицаЗначений.Колонки.Добавить("Номер"); 
		ТаблицаЗначений.Колонки.Добавить("Длина"); 
		
		Пока СписокПлатежек.Следующий() Цикл
			НоваяСтрока = ТаблицаЗначений.Добавить(); 
			НоваяСтрока.Номер = СписокПлатежек.НомерПоручения; 
			НоваяСтрока.Длина = СтрДлина(СписокПлатежек.НомерПоручения); 
		КонецЦикла;
		
		ТаблицаЗначений.Сортировать("Длина Убыв, Номер Убыв");
		
		Попытка
			НомерПорученияЧисло = Число(ТаблицаЗначений[0].Номер) + 1;
			НомерПоручения = Формат(НомерПорученияЧисло, "ЧГ=0");
		Исключение
			НомерПоручения = 1;
		КонецПопытки;
	Иначе
		НомерПоручения = "1";
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытий

// Процедура - обработчик события ОбработкаПроверкиЗаполнения объекта.
//
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если ВидОперации <> Перечисления.ВидыОперацийПлатежноеПоручение.ПеречислениеНалога Тогда
		УправлениеНебольшойФирмойСервер.УдалитьПроверяемыйРеквизит(ПроверяемыеРеквизиты, "ВидПеречисленияВБюджет");
		УправлениеНебольшойФирмойСервер.УдалитьПроверяемыйРеквизит(ПроверяемыеРеквизиты, "КодБК");
		УправлениеНебольшойФирмойСервер.УдалитьПроверяемыйРеквизит(ПроверяемыеРеквизиты, "КодКОАТУУ");
	КонецЕсли;
	
КонецПроцедуры // ОбработкаПроверкиЗаполнения()

// Процедура - обработчик события ОбработкаЗаполнения.
//
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	СтратегияЗаполнения = Новый Соответствие;
	СтратегияЗаполнения[Тип("Структура")] = "ЗаполнитьПоСтруктуре";
	СтратегияЗаполнения[Тип("ДокументСсылка.ЗаказПоставщику")] = "ЗаполнитьПоЗаказПоставщику";
	СтратегияЗаполнения[Тип("ДокументСсылка.СчетНаОплатуПоставщика")] = "ЗаполнитьПоСчетНаОплатуПоставщика";
	СтратегияЗаполнения[Тип("ДокументСсылка.РасходДСПлан")] = "ЗаполнитьПоРасходДСПлан";
	
	ЗаполнениеОбъектовУНФ.ЗаполнитьДокумент(ЭтотОбъект, ДанныеЗаполнения, СтратегияЗаполнения);
	
КонецПроцедуры // ОбработкаЗаполнения()

Процедура ПриКопировании(ОбъектКопирования)
	
	#Если НЕ ВнешнееСоединение Тогда
		
	Если ЗначениеЗаполнено(ОбъектКопирования.Ссылка)
	   И ОбъектКопирования.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПлатежноеПоручение.ПеречислениеНалога") Тогда
		КодКОАТУУ = "";
	КонецЕсли;
		
	#КонецЕсли
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если НЕ ЗначениеЗаполнено(ДатаПоручения) Тогда
		ДатаПоручения = ТекущаяДата();
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(НомерПоручения) Тогда
		УстановитьНомерПоручения()
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
